<a href="https://colab.research.google.com/github/skyworld19/ds-school-advanced/blob/master/05_pandas_%EB%B3%B5%EC%A0%9C_%EA%B2%B0%EC%B8%A1%EC%B9%98_LAB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 패키지 설치

In [2]:
!pip install mySUNI

Collecting mySUNI
  Downloading mySUNI-1.2.2-py3-none-any.whl (21 kB)
Requirement already satisfied: tqdm in /usr/local/lib/python3.7/dist-packages (from mySUNI) (4.62.0)
Installing collected packages: mySUNI
Successfully installed mySUNI-1.2.2

## 모듈 import

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
from mySUNI import cds
from IPython.display import Image

## 데이터셋 로드

In [ ]:
df = sns.load_dataset('titanic')
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

**컬럼(columns) 설명**

- survivied: 생존여부 (1: 생존, 0: 사망)
- pclass: 좌석 등급 (1등급, 2등급, 3등급)
- sex: 성별
- age: 나이
- sibsp: 형제 + 배우자 수
- parch: 부모 + 자녀 수
- fare: 좌석 요금
- embarked: 탑승 항구 (S, C, Q)
- class: pclass와 동일
- who: 성별과 동일
- adult_male: 성인 남자 여부
- deck: 데크 번호 (알파벳 + 숫자 혼용)
- embark_town: 탑승 항구 이름
- alive: 생존여부 (yes, no)
- alone: 혼자 탑승 여부

## copy

DataFrame을 **복제**합니다. 복제한 DataFrame을 수정해도 **원본에는 영향을 미치지 않습니다.**

In [ ]:
df.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

`copy()`로 DataFrame을 복제합니다.

In [ ]:
df_copy = df.copy()

id 값을 확인하면 두 DataFrame의 **메모리 주소가 다름**을 확인할 수 있습니다.

In [ ]:
id(df), id(df_copy)

(139991014992592, 139991010111696)

In [ ]:
df_copy.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

`df_copy`의 `age`를 99999로 임의 수정하도록 하겠습니다.

In [ ]:
df_copy.loc[0, 'age'] = 99999

수정사항이 반영된 것을 확인할 수 있습니다.

In [ ]:
df_copy.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,99999.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

하지만, 원본 DataFrame의 **데이터는 변경되지 않고 그대로 남아** 있습니다.

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 결측치

결측치는 **비어있는 데이터**를 의미합니다.

결측치에 대한 처리는 매우 중요합니다. 

결측치에 대한 처리를 해주려면 **다음의 내용**을 반드시 알아야 합니다.

1. 결측 데이터 확인
2. 결측치가 **아닌** 데이터 확인
3. 결측 데이터 **채우기**
4. 결측 데이터 **제거하기**

## 결측치 확인 - isnull(), isna()

컬럼(column)별 결측치의 갯수를 확인하기 위해서는 `sum()` 함수를 붙혀주면 됩니다.

`sum()`은 Pandas의 통계 관련 함수이며, 통계 관련 함수는 추후에 더 자세히 알아볼 예정입니다.

In [ ]:
pd.Series([True, False, True, False, True]).sum() # True를 1로 인식

3

**isnull()**

In [ ]:
df['age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: age, Length: 891, dtype: bool

In [ ]:
s = df.isnull().sum()
s[s>0]

age            177
embarked         2
deck           688
embark_town      2
dtype: int64

**isna()**

isnull() 과 동작이 완전 같습니다. 편한 것으로 써주세요. (심지어 도큐먼트도 같습니다)

In [ ]:
df.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

DataFrame 전체 결측 데이터의 갯수를 합산하기 위해서는 `sum()`을 두 번 사용하면 됩니다.

In [ ]:
# 전체 결측 데이터의 개수를 확인합니다.
df.isna().sum().sum() # 앞에 sum은 dataframe sum. 뒤의 sum은 Series의 sum

869

## 결측치가 아닌 데이터 확인 - notnull()

`notnull()`은 `isnull()`과 정확히 **반대** 개념입니다.

In [ ]:
df.notnull().sum()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 결측 데이터 필터링

`isnull()` 함수가 결측 데이터를 찾는 **boolean index** 입니다.

즉, `loc`에 적용하여 조건 필터링을 걸 수 있습니다.

In [ ]:
# df의 'age' 컬럼에 대해 결측치인 정보를 가져와 출력해 보세요.  (basic indexing, loc 사용)
df.loc[df['age'].isnull(),:]

     survived  pclass     sex  age  ...  deck  embark_town  alive  alone
5           0       3    male  NaN  ...   NaN   Queenstown     no   True
17          1       2    male  NaN  ...   NaN  Southampton    yes   True
19          1       3  female  NaN  ...   NaN    Cherbourg    yes   True
26          0       3    male  NaN  ...   NaN    Cherbourg     no   True
28          1       3  female  NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...  ...  ...   ...          ...    ...    ...
859         0       3    male  NaN  ...   NaN    Cherbourg     no   True
863         0       3  female  NaN  ...   NaN  Southampton     no  False
868         0       3    male  NaN  ...   NaN  Southampton     no   True
878         0       3    male  NaN  ...   NaN  Southampton     no   True
888         0       3  female  NaN  ...   NaN  Southampton     no  False

[177 rows x 15 columns]

## 결측치 채우기 - fillna()

`fillna()`를 활용하면 결측치에 대하여 **일괄적으로 값을 채울 수** 있습니다.

In [ ]:
# 원본을 copy하여 df1 이름 붙이기
df1 = df.copy()

In [ ]:
df1['age'].tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

888번 index의 **결측치가 700으로 채워**진 것을 확인할 수 있습니다.

In [ ]:
# df1의 'age' 컬럼의 결측치를 700으로 채우기하여, 마지막 5개 데이터를 출력해 봅니다.
df1['age'].fillna(700).tail()

886     27.0
887     19.0
888    700.0
889     26.0
890     32.0
Name: age, dtype: float64

In [ ]:
# df1의 'age' 컬럼을 결측치가 700으로 채워진 내용으로 갱신합니다.
df1 = df1['age'].fillna(700)

In [ ]:
df1.tail()

886     27.0
887     19.0
888    700.0
889     26.0
890     32.0
Name: age, dtype: float64

**카테고리 형 데이터**을 채워주기 위해서는 다음과 같은 과정을 거쳐야 합니다.

In [ ]:
df['deck'].head()

0    NaN
1      C
2    NaN
3      C
4    NaN
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

이미 카테고리가 추가된 'A'나 'B'는 바로 fillna() 할 수 있습니다.

In [ ]:
# df1의 'deck' 컬럼의 결측치를 'A'로 채우기합니다.  (갱신은 하지 않음)
df1['deck'].fillna('A')

0      A
1      C
2      A
3      C
4      A
      ..
886    A
887    B
888    A
889    C
890    A
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

하지만, 없는 카테고리로 채워주고자 할 때는 먼저 `cat.add_categories`로 카테고리를 추가한 후 채워야 합니다.

In [ ]:
# cat은 category의 지정자
# add_categories (카테고리 추가)
# df1의 'deck'의 cat.add_categories()를 사용하여 'No Data'라는 카테고리를 추가하고
# 결측치를 'No Data'로 채우기 합니다.
df1['deck'].cat.add_categories('No Data').fillna('No Data')

0      No Data
1            C
2      No Data
3            C
4      No Data
        ...
886    No Data
887          B
888    No Data
889          C
890    No Data
Name: deck, Length: 891, dtype: category
Categories (8, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'No Data']

## 통계값으로 채우기

In [ ]:
df1 = df.copy()

In [ ]:
df1['age'].tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

### 평균으로 채우기

In [ ]:
# df1의 'age'의 결측치를 df1의 'age' 평균값으로 채우기 하고, 마지막 5개의 데이터를 확인합니다.
df1['age'].fillna(df1['age'].mean()).tail()

886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, dtype: float64

In [ ]:
df1.groupby('who')['age'].mean()

who
child     6.369518
man      33.173123
woman    32.000000
Name: age, dtype: float64

In [ ]:
# who 별로 age 평균을 내고 그 평균값을 결측치로 채움
df1['age_mean'] = df1.groupby('who')['age'].transform('mean')
df1[['age', 'who', 'age_mean']]
df1['age'].where(df1['age'].notnull(), df1['age_mean'])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    32.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

### 중앙값으로 채우기

In [ ]:
# df1의 'age'의 결측치를 df1의 'age' 중앙값으로 채우기 하고, 마지막 5개의 데이터를 확인합니다.
df1['age'].fillna(df1['age'].median()).tail()

886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: age, dtype: float64

### 최빈값으로 채우기

In [ ]:
# df1의 'deck'에 대한 최빈값을 구해 봅니다.  (mode() 메서드 사용)
df1['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

**최빈값(mode)**으로 채울 때에는 반드시 **0번째 index 지정**하여 값을 추출한 후 채워야 합니다.

In [ ]:
# 최빈값에서 가장 처음에 있는 값을 출력해 봅니다. (indexing 사용)
df1['deck'].mode()[0]

'C'

In [ ]:
# df1의 'deck'에 대해서 결측치를 최빈값으로 채우기하고, 마지막 5개의 데이터를 출력해 봅니다.
df1['deck'].fillna(df1['deck'].mode()[0]).tail()

886    C
887    B
888    C
889    C
890    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

## NaN 값이 있는 데이터 제거하기 (dropna)

In [ ]:
df1 = df.copy()

In [ ]:
df1.tail()

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[5 rows x 15 columns]

`dropna()`로 **1개 라도 NaN 값이 있는 행**은 제거할 수 있스빈다. (`how='any'`)

In [ ]:
# df1에서 1개 라도 NaN 값이 있는 행을 제거합니다.
df1.dropna(how='any')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
3           1       1  female  35.0  ...     C  Southampton    yes  False
6           0       1    male  54.0  ...     E  Southampton     no   True
10          1       3  female   4.0  ...     G  Southampton    yes  False
11          1       1  female  58.0  ...     C  Southampton    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
871         1       1  female  47.0  ...     D  Southampton    yes  False
872         0       1    male  33.0  ...     B  Southampton     no   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
887         1       1  female  19.0  ...     B  Southampton    yes   True
889         1       1    male  26.0  ...     C    Cherbourg    yes   True

[182 rows x 15 columns]

기본 옵션 값은 `how=any`로 설정되어 있으며, 다음과 같이 변경할 수 있습니다.

- **any**: 1개 라도 NaN값이 존재시 drop
- **all**: 모두 NaN값이 존재시 drop

In [ ]:
# df1에서 모든 값이 결측치인 행을 제거합니다. (how='all' 사용)
df1.dropna(how='all')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

# 연습문제

data폴더에 있는 mySUNI_1.csv를 읽어 df에 저장하세요.

In [4]:
# 코드를 입력하세요.
cds.download_data(['PandasFileIO'])

파일 다운로드 완료
====================

데이터셋: PandasFileIO
파일경로: data/mySUNI.xlsx

====================
파일 다운로드 완료
====================

데이터셋: PandasFileIO
파일경로: data/mySUNI_1.csv

====================
파일 다운로드 완료
====================

데이터셋: PandasFileIO
파일경로: data/mySUNI_2.csv

====================
파일 다운로드 완료
====================

데이터셋: PandasFileIO
파일경로: data/mySUNI_3.csv

====================

In [5]:
df = pd.read_csv('data/mySUNI_1.csv')
df.head()

       지역     GS칼텍스_셀프     GS칼텍스_일반  ...  자가상표_일반    현대오일뱅크_셀프    현대오일뱅크_일반
0  서울 강남구  1479.628286  1647.372500  ...      NaN  1408.822500  1604.995806
1  서울 강동구  1451.558750  1472.213056  ...      NaN  1412.656667  1441.861667
2  서울 강북구  1342.991667  1373.801667  ...      NaN  1353.985814          NaN
3  서울 강서구  1403.752500  1429.829167  ...      NaN  1339.844737  1406.236939
4  서울 관악구  1425.005238  1472.719583  ...      NaN  1420.116250  1453.778750

[5 rows x 14 columns]

각 열별 결측치의 개수를 조회하세요.

In [ ]:
# 코드를 입력하세요.
df.isnull().sum()

지역            0
GS칼텍스_셀프      5
GS칼텍스_일반      1
S-OIL_셀프      5
S-OIL_일반      5
SK에너지_셀프      4
SK에너지_일반      1
알뜰(ex)_셀프    24
알뜰주유소_셀프     20
알뜰주유소_일반     18
자가상표_셀프      24
자가상표_일반      23
현대오일뱅크_셀프     4
현대오일뱅크_일반     1
dtype: int64

각 행별 결측치의 개수를 조회하세요.

In [ ]:
# 코드를 입력하세요.
df.isnull().sum(1)

0      5
1      5
2      6
3      4
4      4
5      5
6      5
7      5
8      7
9      5
10     5
11     6
12     6
13     5
14     4
15     4
16     4
17     5
18     5
19     4
20    10
21     4
22     8
23     8
24     6
dtype: int64

전체 NA 개수를 계산하세요.

In [ ]:
# 코드를 입력하세요.
df.isnull().sum().sum()
#df.T.isnull().sum()

135

각 열별 결측치의 평균(비율)을 계산하세요.

In [ ]:
# 코드를 입력하세요.
df.isna().mean()
#df.isnull().sum() / len(df)
#df.isnull().sum() / df.shape[0]

지역           0.00
GS칼텍스_셀프     0.20
GS칼텍스_일반     0.04
S-OIL_셀프     0.20
S-OIL_일반     0.20
SK에너지_셀프     0.16
SK에너지_일반     0.04
알뜰(ex)_셀프    0.96
알뜰주유소_셀프     0.80
알뜰주유소_일반     0.72
자가상표_셀프      0.96
자가상표_일반      0.92
현대오일뱅크_셀프    0.16
현대오일뱅크_일반    0.04
dtype: float64

데이터의 개수가 15개 미만인 컬럼을 제거 후 다시 df 변수에 저장하세요.
- 의미 : 결측치 비율이 0.6 이상인 컬럼 제거

In [6]:
df.shape, 15/25

((25, 14), 0.6)

In [ ]:
# 코드를 입력하세요.
df = df.dropna(axis=1, thresh=15)
#df = df.drop(df.loc[:, ((df.isna().sum())/len(df)) >= 0.6],axis = 1)
df

         지역     GS칼텍스_셀프     GS칼텍스_일반  ...     SK에너지_일반    현대오일뱅크_셀프    현대오일뱅크_일반
0    서울 강남구  1479.628286  1647.372500  ...  1790.737444  1408.822500  1604.995806
1    서울 강동구  1451.558750  1472.213056  ...  1666.781667  1412.656667  1441.861667
2    서울 강북구  1342.991667  1373.801667  ...  1347.262500  1353.985814          NaN
3    서울 강서구  1403.752500  1429.829167  ...  1485.694000  1339.844737  1406.236939
4    서울 관악구  1425.005238  1472.719583  ...  1466.670278  1420.116250  1453.778750
5    서울 광진구          NaN  1409.874667  ...  1414.259167  1372.834231  1376.601667
6    서울 구로구  1349.338333  1580.261111  ...  1417.576415  1365.516522  1422.016774
7    서울 금천구  1382.317059          NaN  ...  1427.995122  1382.120417  1386.201429
8    서울 노원구  1381.040833  1459.922778  ...  1509.330833          NaN  1467.670000
9    서울 도봉구  1358.418750  1404.916667  ...  1478.190000  1388.036452  1344.847742
10  서울 동대문구  1391.806250  1382.023636  ...  1428.111897  1371.264167  1427.322885
11   서울 동작구  1435.480000  1403.587917  ...  1529.880833  1407.263846  1421.757083
12   서울 마포구          NaN  1439.495000  ...  1561.930462  1444.157143  1453.200000
13  서울 서대문구  1395.398261  1386.623333  ...  1444.818049  1375.766429  1376.517895
14   서울 서초구  1462.796087  1446.435069  ...  1617.880787  1402.675714  1464.420600
15   서울 성동구  1396.703333  1708.895833  ...  1505.038429  1387.657083  1582.866667
16   서울 성북구  1346.266667  1383.025278  ...  1413.591176  1344.361754  1372.565263
17   서울 송파구  1409.809722  1422.576250  ...  1481.395094  1404.777097  1424.252581
18   서울 양천구  1359.940833  1374.683750  ...  1504.570000  1373.028070  1417.873023
19  서울 영등포구  1408.771875  1626.469577  ...  1666.417143  1368.888000  1473.165806
20   서울 용산구          NaN  1806.439167  ...  1907.432414          NaN  1807.390303
21   서울 은평구  1375.465667  1395.541667  ...  1435.582000  1362.752400  1391.851429
22   서울 종로구          NaN  2024.467917  ...  1952.163000          NaN  1615.330000
23    서울 중구          NaN  2038.513721  ...  1975.886500          NaN  1659.430833
24   서울 중랑구  1363.768958  1350.486667  ...          NaN  1359.062857  1338.245833

[25 rows x 9 columns]

결측치를 0으로 대체하세요.

In [ ]:
# 코드를 입력하세요.
df.fillna(0)

         지역     GS칼텍스_셀프     GS칼텍스_일반  ...     SK에너지_일반    현대오일뱅크_셀프    현대오일뱅크_일반
0    서울 강남구  1479.628286  1647.372500  ...  1790.737444  1408.822500  1604.995806
1    서울 강동구  1451.558750  1472.213056  ...  1666.781667  1412.656667  1441.861667
2    서울 강북구  1342.991667  1373.801667  ...  1347.262500  1353.985814     0.000000
3    서울 강서구  1403.752500  1429.829167  ...  1485.694000  1339.844737  1406.236939
4    서울 관악구  1425.005238  1472.719583  ...  1466.670278  1420.116250  1453.778750
5    서울 광진구     0.000000  1409.874667  ...  1414.259167  1372.834231  1376.601667
6    서울 구로구  1349.338333  1580.261111  ...  1417.576415  1365.516522  1422.016774
7    서울 금천구  1382.317059     0.000000  ...  1427.995122  1382.120417  1386.201429
8    서울 노원구  1381.040833  1459.922778  ...  1509.330833     0.000000  1467.670000
9    서울 도봉구  1358.418750  1404.916667  ...  1478.190000  1388.036452  1344.847742
10  서울 동대문구  1391.806250  1382.023636  ...  1428.111897  1371.264167  1427.322885
11   서울 동작구  1435.480000  1403.587917  ...  1529.880833  1407.263846  1421.757083
12   서울 마포구     0.000000  1439.495000  ...  1561.930462  1444.157143  1453.200000
13  서울 서대문구  1395.398261  1386.623333  ...  1444.818049  1375.766429  1376.517895
14   서울 서초구  1462.796087  1446.435069  ...  1617.880787  1402.675714  1464.420600
15   서울 성동구  1396.703333  1708.895833  ...  1505.038429  1387.657083  1582.866667
16   서울 성북구  1346.266667  1383.025278  ...  1413.591176  1344.361754  1372.565263
17   서울 송파구  1409.809722  1422.576250  ...  1481.395094  1404.777097  1424.252581
18   서울 양천구  1359.940833  1374.683750  ...  1504.570000  1373.028070  1417.873023
19  서울 영등포구  1408.771875  1626.469577  ...  1666.417143  1368.888000  1473.165806
20   서울 용산구     0.000000  1806.439167  ...  1907.432414     0.000000  1807.390303
21   서울 은평구  1375.465667  1395.541667  ...  1435.582000  1362.752400  1391.851429
22   서울 종로구     0.000000  2024.467917  ...  1952.163000     0.000000  1615.330000
23    서울 중구     0.000000  2038.513721  ...  1975.886500     0.000000  1659.430833
24   서울 중랑구  1363.768958  1350.486667  ...     0.000000  1359.062857  1338.245833

[25 rows x 9 columns]